{
    "antelope": "Because of its massive diversity, it is difficult to talk about a single characteristic or appearance of the antelope. Most tend to have a deer-like appearance with spikes or corkscrew horns, but the largest members of the group almost resemble a cross between a deer and cattle. There are generally two types of antelope, which vary by habitat. Small to medium animals such as the duikers and reedbucks are more adapted to concealed cover in forests and wetlands. Thanks to their short legs, round back, and large rear end, they are capable of fast, sporadic movements to elude predators. These animals have camouflaged colorings or markings to provide an extra layer of defense. They tend to forage on foliage by themselves but then pair together with mates monogamously during the breeding season. The larger antelopes, on the other hand, are built for deserts, open plains, and savannas. They graze on the grass and rely on pure speed to help them avoid predators. Some herds consist of no more than 10 or 20 individuals, while other antelopes have herds of thousands, which can make for quite the spectacle on the open plains. These herds may undertake large migrations during certain parts of the year in search of new food reservoirs and grazing land. Males tend to have larger bodies and horns than females, but in a few species, the females may lack horns altogether, or they will have smaller horns than the males. An antelope typically has slender and agile build, with long legs and a short tail. They have a distinctive pair of pointed horns that curve backwards, and they typically have a coat of fur that is brown, tan, or gray in color with white underbelly.  Antelopes tend to live exclusively in either forests or open plains, rarely mixing the two. Pronghorn antelope grazing in grasslands.",
    "grizzly bear": "Grizzly bears are animals that may be very light brown or dark brown. Grizzlies have large heads, dish-shaped faces, short round ears, and short tails. The stout bears have a large muscular hump on the upper back that provides strength for digging. The claws on the grizzly’s front paws are curved, large, and sturdy, which help the bear dig in the ground for food. The grizzly’s claws are also handy for turning over rocks to find insects. Grizzlies that live where food is plentiful tend to weigh more. The bears spend most of their time alone, roaming their habitat and searching for food. Although the grizzly is a loner, it is not unusual to see several grizzlies feeding on the fish near rivers where salmon are plentiful. Grizzly bears are animals that hibernate or are inactive during the cold months. They store enough fat during the summer to sustain them during hibernation. Grizzlies dig a den or find a cave for hibernation. Once a grizzly enters hibernation, it rests there for about five months. During that time, the bear does not eat, drink, urinate, or defecate. In early spring, grizzlies come out of hibernation. Grizzlies may be very light brown or dark brown and have large heads, dish-shaped faces, short round ears, and short tails. A grizzly bear is a large brown-colored bear with a distinctive hump on its shoulder. They have a muscular build, shaggy fur, and a prominent snout with a concave facial profile. Their ears are small and rounded, and their claws are long, curved, and sharp.  Grizzly bear habitat varies depending on location, but typically it includes mountains, forests, meadows, and other areas with ample food sources such as berries, nuts, and fish. The landscape may include rugged terrain and large bodies of water, such as rivers and lakes. The habitat may also contain caves, dens, and hollow trees that provide shelter and protection from the elements. ",
    "killer whale": "Orcas have a smooth black back including a large dorsal fin while their underside is bright white. Orcas are the largest extant members of the dolphin family. With their distinctive pigmentation, adult orcas are seldom confused with any other species. When seen from a distance, juveniles can be confused with false killer whales or Risso's dolphins. The orca typically has a sharply contrasted black-and-white body; being mostly black on the upper side and white on the underside. The entire lower jaw is white and from here, the colouration stretches across the underside to the genital area; narrowing between the flippers then widening some and extending into lateral flank patches close to the end. The tail fluke is also white on the underside, while the eyes have white oval-shaped patches behind and above them, and a grey or white saddle patch exists behind the dorsal fin and across the back. Males and females also have different patterns of black and white skin in their genital areas. In newborns, the white areas are yellow or orange colored. Antarctic orcas may have pale grey to nearly white backs. Some Antarctic orcas are brown and yellow due to diatoms in the water. A killer whale, also known as an orca, has a black and white distinct coloration with a large dorsally located dorsal fin. It has a sturdy and robust body with a pointed head and rounded forehead. It has a white eye patch behind each eye, and a gray saddle patch behind its dorsal fin. Orcas are found in all oceans and most seas. These animals can live in both cold and warm water habitats.",
    "beaver": "The beaver has a stout body, strong neck, oversized head, short and rounded ears, dexterous hands, webbed feet, and a flat tail. Its reddish dark brown waterproof fur is composed of two layers: a soft lower layer and stiffer protective upper layer. The beaver’s back foot has a specialized claw that functions as a comb for cleaning its fur. The beaver has a unique adaptations to help it survive in its natural habitat. Its sharp incisors, which are fortified with iron and trace minerals (giving it an orange color), have a slight backward curve to aid it in cutting down trees. Its large, flat, leathery tail serves multiple purposes: it stores excess fat for the winter, provides a useful warning to others when slapped in the water, and braces the body against the ground as it chews into trees. When it’s submerged, the beaver’s ears, nose, nictitating membrane (an additional eyelid), and lips behind the teeth can all be closed off to prevent water from entering its body. Propelled by their hind feet, beavers can swim through the waters at around 5 mph. A beaver is a large, semi-aquatic rodent with a broad, flat tail, webbed hind feet, and two large, sharp incisors that it uses to gnaw on trees and build dams. They have short, brown fur that covers their stocky bodies and are typically around 3-4 feet long, including their tail. Their front teeth are noticeably orange and stand out against the rest of their dark fur. Beavers also have small eyes and prominent ears.  They are found exclusively in freshwater ecosystems such as streams, lakes, ponds, and rivers with heavy woods and shrubs.",
    "dalmatian": "A Dalmatian is a medium-sized dog breed with a short, smooth coat that is white with black or liver-colored spots. They have a muscular and athletic build, with strong legs and an elongated snout. They typically have dark eyes and a friendly expression, with high-set, floppy ears. Dalmatians have a short, dense coat of fur that is typically white with black spots. They are medium-sized dogs with a lean and muscular build. In terms of habitat, Dalmatians are adaptable to various environments, but they prefer open spaces where they can run and play. They are often kept as domestic pets and can be found living in suburban or urban settings. The Dalmatian coat is usually short, fine, and dense; however, smooth-coated Dalmatians occasionally produce long-coated offspring.",
    "persian cat": "A Persian cat has a flat, round face with a short, wide nose and large, round eyes. Its ears are small and tufted with long, silky fur. The fur around the neck is also long and thick, forming a collar or ruff, and the rest of the body is covered in dense, luxurious fur. Persian cats come in a variety of colors and patterns, including solid, bicolor, and tabby. They are generally medium to large in size, with a sturdy, cobby body shape. A show-style Persian cat has an extremely long and thick coat, short legs, a wide head with the ears set far apart, large eyes, and an extremely shortened muzzle. Persian cats can have virtually any color or markings. Eye colors range widely, and may include blue, copper, odd-eyed blue and copper, green, blue-green, and hazel. If you are referring to a Persian cat's environment or housing, it typically includes a clean litter box, comfortable bedding, and toys for entertainment. Persian cats are also known to enjoy high perches or shelving to climb and observe their surroundings.",
    "german shepherd": "German Shepherds are medium to large-sized dogs. They have a domed forehead, a long square-cut muzzle with strong jaws and a black nose. The eyes are medium-sized and brown. The ears are large and stand erect, open at the front and parallel, but they often are pulled back during movement. Their ears are large and erect, and their eyes are almond-shaped and usually dark in color.  A German Shepherd has a long neck, which is raised when excited and lowered when moving at a fast pace as well as stalking. The tail is bushy and reaches to the hock. German Shepherds have a double coat which is close and dense with a thick undercoat. The coat is accepted in two variants: medium and long. Most commonly, German Shepherds are either tan/black or red/black. Most colour varieties have black masks and black body markings which can range from a classic saddle to an overall blanket. Rarer colour variations include sable, pure-black, pure-white, liver, silver, blue, and panda varieties. German Shepherds are adaptable and can thrive in various habitats, including urban, suburban, and rural areas.",
    "siamese cat": "The breed standard of the modern Siamese calls for an elongated, tubular, and muscular body and a triangular head, forming a perfect triangle from the tip of the nose to each tip of the ear. The eyes are almond-shaped and light blue, while the ears are large, wide-based, and positioned more toward the side of the head. The breed has a long neck, a slender tail, and fur that is short, glossy, fine and adheres to the body with no undercoat. Its pointed color scheme and blue eyes distinguish it from the closely related Oriental Shorthair. Their distinctive coloring consists of a pale, creamy body and dark points on their ears, face, tail, and feet. The color of their points can vary between seal (dark brown), chocolate (medium brown), blue (gray), or lilac (pinkish-gray). The modern Siamese shares the pointed color pattern with the Thai or traditional Siamese, but they differ in head and body type. Their habitat usually consists of a comfortable and cozy bed, scratching posts or trees to climb, toys to play with, food and water bowls, and a clean litter box. Siamese cats love to perch on elevated surfaces and sunbathe by windows, so their habitat may include a window perch or a cat tree with a viewing platform.",
    "skunk": "Skunks are black and white mammals with distinctive markings. They have glossy black fur with a white stripe that runs from their head down their back, which can split into two stripes on their tail. They have short legs and long claws for digging, and their eyes are small and black. They have moderately elongated bodies with relatively short, well-muscled legs and long front claws for digging. Although the most common fur color is black and white, some skunks are brown or grey and a few are cream-colored. All skunks are striped, even from birth. They may have a single thick stripe across the back and tail, two thinner stripes, or a series of white spots and broken stripes (in the case of the spotted skunk). The most recognizable species has black fur with two wide stripes of white on its back. Other species have swirls or spots of white on their black fur. Skunk’s traditional black and white coat makes it easily recognizable by humans. These animals have four feet, tiny black eyes, and bristly tails with a mixture of black and white fur.  They inhabit a variety of environments including forests, deserts, grasslands, and even urban areas. Skunks can make dens in hollow logs, rock crevices, under porches, and beneath fallen trees or bushes. They also prefer habitats near a source of water such as streams, ponds, or rivers.",
    "mole": "A mole is a small, dark-colored growth on the skin. It can range in size and shape and may be flat or slightly raised. Moles can be black, brown, or a mixture of colors and may have a slightly rough texture.  The mole is an animal with a striking, distinctive appearance, well-adapted for its burrowing lifestyle. Its massive hands, short limbs, and sharp claws enable it to burrow through the ground with relative ease. These hands also sometimes make excellent paddles for swimming. Moles animals spend the majority of their lives underground, only traveling to the surface to gather nest material and find water during droughts. Other interesting features of the mole include the small, beady eyes and the lack of visible external ear flaps. This is complemented by a short tail and a hairless pointed snout lined with whiskers. The long, flat body is covered in black or brown fuzzy fur as well. A mole is a small, dark-colored growth on the skin. It can range in size and shape and may be flat or slightly raised. Moles can be black, brown, or a mixture of colors and may have a slightly rough texture. It prefers temperate ecosystems with moist or loose soil, including prairies, floodplains, forests, coastal dunes, wetlands, gardens, cultivated fields, and lowland or alpine meadows.",
    "tiger": "A tiger has a heavy coat of reddish-orange hair featuring a pattern of black stripes. Each has its own pattern of stripes kind of like a human’s fingerprints. It has a long tail as well as sharp teeth and claws. It uses its tail to maintain balance when making quick turns as it runs after prey. In addition, its paws allow it to walk quietly while stalking its next meal. Also, they have webbed feet making them excellent swimmers if they have to cross a river, stream, or other body of water in search of prey. The tiger has a muscular body with strong forelimbs, a large head and a tail that is about half the length of its body. Its pelage coloration varies between shades of orange with a white underside and distinctive vertical black stripes; the patterns of which are unique in each individual. Stripes are likely advantageous for camouflage in vegetation such as long grass with strong vertical patterns of light and shade. The orange color may also aid in camouflage as the tiger's prey are dichromats, and thus may perceive the cat as green and blended in with the vegetation. A tiger's coat pattern is still visible when it is shaved. It has a mane-like heavy growth of fur around the neck and jaws and long whiskers, especially in males. The pupils are circular with yellow irises. The small, rounded ears have a prominent white spot on the back, surrounded by black. These spots are thought to play an important role in intraspecific communication. Generally, a tiger is a large, powerful, and striped cat with a distinctive coat pattern of dark stripes on reddish orange fur. It has a muscular body, sharp claws, and a long tail. It has a broad head with strong jaws and yellow or amber-colored eyes.  Tigers live in different habitats including swamps, grasslands, and deciduous and mangrove forests. These habitats have dense vegetation and several water sources such as rivers and lakes. The tropical forests have rich biodiversity, rugged terrain with mountains and hills, streams, waterfalls, and rocky outcrops. The grasslands, on the other hand, are open plains with tall grass, shrubs, and a few scattered trees.",
    "hippopotamus": "A hippopotamus is a large, semi-aquatic mammal with short legs, a barrel-shaped body, and a large head. They have dark gray or brown skin, which is hairless and thin. Hippopotamuses have two small ears, a wide mouth, and short, thick ivory tusks. They are known for their short and stubby legs, each ending in four toes with a flat hoof-like appearance. The hippopotamus has an enormous grey barrel-shaped body that can measure up to 16 feet in length and weigh more than four tons, and which is held up by short and stocky legs. One of the hippopotamus’s most distinctive features is its enormous jaws which contain two long canine teeth (tusks) which can grow up to 20 inches long and are used for fighting. Due to the fact that the hippopotamus is an animal that spends most of its life resting in the water, they have a number of excellent adaptations to aid its semi-aquatic lifestyle, including four webbed toes on each foot that help with swimming and walking on slippery banks, and the eyes, ears, and nostrils of the hippopotamus are situated on the top of its head. This means that when the hippopotamus’s body is immersed in the water, they are still able to see, hear, and breathe whilst keeping cool in the hot sun. Hippos are found in Africa, primarily in rivers, lakes, and swamps that have deep water and mud.",
    "leopard": "The leopard's fur is generally soft and thick, notably softer on the belly than on the back. Its skin color varies between individuals from pale yellowish to dark golden with dark spots grouped in rosettes. Its belly is whitish and its ringed tail is shorter than its body. Its pupils are round. Spots fade toward the white underbelly and the insides and lower parts of the legs. The fur tends to be grayish in colder climates, and dark golden in rain forest habitats. The pattern of the rosettes is unique in each individual. The leopard is an animal with a long, lithe body that is supported by powerful legs and a long tail that is used for balance in the trees. Leopards can vary greatly in their coloration and markings depending on their surrounding habitat, with those found on open grasslands having a light yellow, sun-bleached background coat whereas those that are found in forests tend to be darker to blend into the shade and with more markings for camouflage. The dark, ring-like patterns that cover the leopard’s coat are called rosettes, but these turn into solid spots on the face and limbs (and rings on the tail) and provide the leopard with camouflage into the surrounding environment. Leopards are incredibly strong and muscular animals and are able to pull themselves up trees using their legs and retractable claws. A leopard has short, golden-yellow fur with black spots and rosettes arranged in circles on its body. The spots on the leopard's head, neck and legs are solid, while the spots on its back, sides and tail are circular. Its fur is also dense and soft to the touch. It has sharp, retractable claws to help it climb and hunt, and its eyes are a distinct greenish color.  Leopards spend much of their time in trees – often waiting to jump down on unsuspecting prey. The leopard can be found inhabiting numerous different areas providing that there is a good source of cover and an ample supply of food including tropical rainforests, tree-lined savannas, barren deserts, and mountain highlands.",
    "moose": "Moose are very large, sturdy, and strong animals. Their bones are large and their bodies are muscular. Moose fur is light brown to dark brown in color, easily camouflaging them in their surroundings. This fur is long and thick, with each hair being hollow to aid in warmth. Their legs are long, with the front pair being slightly longer than the back. This makes moose appear gangling and clumsy. But the longer front legs help them amble over forest debris, such as fallen trees and branches. The moose’s head is long like a horse‘s, but features an enlarged nose and upper lip. Their ears are small, as is their tail. Adding to their funny faced-appearance is a humpback appearance caused by large and strong shoulder muscles. On their throat hangs loose skin called a dewlap. Large, broad, and flat antlers make a moose’s appearance even more distinct from other members of the deer family. Only males have these antlers that stretch between four and six feet across at full growth. These antlers start growing in late spring or early summer, first covered by a fuzzy skin called velvet. A moose is a large, dark brown or grayish-brown herbivorous mammal with long, slender legs, a broad, flattened snout, and a drooping, bulbous nose. It has a distinctive hump on its shoulders, and both males and females have broad, flat antlers that grow out from their heads in a wide, branching shape. A moose is a large, dark brown or grayish-brown herbivorous mammal with long, slender legs, a broad, flattened snout, and a drooping, bulbous nose. It has a distinctive hump on its shoulders, and both males and females have broad, flat antlers that grow out from their heads in a wide, branching shape. Moose have large, rounded ears and short tails.  Moose habitats are typically located in boreal forests, taiga, and sub-arctic regions, which are characterized by dense forests, wetlands, and lakes. They prefer areas with abundant vegetation for grazing, and prefer to be near water sources. Moose habitats are usually covered with dense evergreen trees, shrubs, and moss, which provide them with both shelter and food. The habitat may also have ponds, lakes, rivers, and streams where moose can find fresh water and feed on aquatic vegetation. Moose live throughout the colder northern regions where there is annual snow cover.",
    "spider monkey": "Spider monkeys are among the largest of the otherwise small New World monkeys with a weight anywhere between 13 and 24 pounds. Other important features of the spider monkey include the incredibly long arms, the flat nose, eye rings, and the rough hair, which is usually a combination of black, white, brown, or tan. One of the most prominent and important characteristics of this primate is the massive prehensile tail.  Despite the nearly non-existent thumbs, the tail provides the main means through which it can cling to branches and grab objects. The tail itself is much larger than the body, reaching between 20 and 40 inches. Their hair is coarse, ranging in color from ruddy gold to brown and black, or white in a rare number of specimens. The hands and feet are usually black. Heads are small with hairless faces. The nostrils are very far apart, which is a distinguishing feature of spider monkeys. Spider monkeys have long, slender limbs with hooked hands and feet. They have a long prehensile tail which can be used for grasping branches. Their fur is usually black or brown, with lighter hair on their face, throat, and chest. They have a round face with a small, black nose and large, expressive eyes. They have a small, pointed head and long, thin fingers. Spider monkeys typically live in rainforests and other woodlands. Each species generally prefers to reside in the middle layers of rainforests and other woodlands, often near rivers and streams. Their habitat can be densely populated with trees, vines, and other vegetation. From afar, the habitat may appear green and lush due to the vegetation, and spider monkeys can often be seen swinging from tree to tree.",
    "humpback whale": "The humpback whale is easy to distinguish from other whales. It has a small hump near the dorsal fin (which is particularly prominent when it arches its back), a massive pectoral fin about a third the size of the entire body, and hair follicles all over the head and jaw. The humpback also sports a dark back and lighter underside. Each pattern of colors and scars along its stomach is entirely unique to the individual. Females are larger than males on average, which is unusual for a mammal. The body is bulky with a thin rostrum and proportionally long flippers, each around one-third of its body length. It has a short dorsal fin that varies from nearly non-existent to somewhat long and curved. Unique among large whales, humpbacks have bumps or tubercles on the head and front edge of the flippers; the tail fluke has a jagged trailing edge. The dorsal or upper side of the animal is generally black; the ventral or underside has various levels of black and white coloration. Whales in the southern hemisphere tend to have more white pigmentation. The flippers can vary from all-white to white only on the undersurface. A humpback whale is a large marine mammal with a dark bluish-black or grayish-black body, with a white or light gray underbelly. The tail, or fluke, is wide and often has irregular markings that can be used to identify individuals. The humpback tends to live and feed near the shore of oceans and seas all around the world, sometimes swimming as close to land as harbors and rivers.",
    "elephant": "An elephant is a large, grey mammal with a long, flexible trunk that protrudes from its face. The trunk is used for breathing, smelling, drinking, and grasping objects. Elephants have two massive ivory tusks protruding from their upper jaw, which are used for defense and foraging. Their ears are large and shaped like a fan, and they use them to cool themselves down. Elephants have thick wrinkled skin that helps to protect them from the sun and insect bites. Their eyes are small and round, and their tails are long and bushy. Elephants also have four thick and sturdy legs that are capable of supporting their heavy bodies.  Elephants resemble no other animal on the planet. They are distinguished by the huge bodies, stout legs, thin tails, rounded ears, strong trunks, and in some elephants, the ivory tusks. These long tusks, which grow throughout the elephant’s life, are really just incisor teeth; they allow the elephant to dig for food and water, defend itself, and lift heavy objects with ease. Another important aspect of the elephant’s anatomy is the thick, wrinkled skin, which can retain about 10 times the amount of water as smooth skin. The elephant is defined most of all by its size. Much of the skeletal structure is taken up by the huge skull, which supports the large ears, tusks, and trunk. The skull contains big cavities that reduce the weight without diminishing the strength. An elephant’s trunk is surprisingly nimble and strong. The large, rounded ears appear to be a very effective organ for keeping the elephant cool.  The elephant inhabits the savannas, deserts, marshes, and forests near rivers. Generally, elephant habitats have a diverse range of vegetation, including trees, shrubs, and grasses. The areas also have water bodies like rivers, lakes, and ponds where elephants can drink and swim. ",
    "gorilla": "This is an impressively strong animal, and its appearance backs that up. They possess thick chests with wide shoulders and an abdomen that is pushed forward. Adults have long, heavily muscled arms that they use to help propel themselves on their knuckles. Gorillas are covered in black fur except for their faces, hands, and feet; older males also have bare chests. Adult males develop gray or silver hairs in a saddle pattern on their lower back which is why mature males are often referred to as silverbacks. Mountain gorillas have noticeably longer hair than the other three species. Gorillas have truly unique skulls within the animal kingdom. The eastern gorilla is more darkly coloured than the western gorilla, with the mountain gorilla being the darkest of all. The mountain gorilla also has the thickest hair. The western lowland gorilla can be brown or greyish with a reddish forehead. In addition, gorillas that live in lowland forest are more slender and agile than the more bulky mountain gorillas. The eastern gorilla also has a longer face and broader chest than the western gorilla.Their eye colour is dark brown, framed by a black ring around the iris. They have a muscular build with broad chests and long arms that reach almost to their knees. They have dark fur that can range from black to brown or reddish-brown with a patch of silver hair on their backs. They have distinctive faces with a pronounced brow ridge and large nostrils.  They will build nests of vegetation every night, either on the ground or in trees. Generally, they live in tropical and subtropical forests where there is abundant vegetation and water sources. Their habitat may include dense trees, bamboo thickets, and undergrowth. The gorilla habitat may also include rivers or streams, which are important for drinking and bathing. The terrain can be quite rugged with steep slopes and dense vegetation.",
    "ox": "Oxen are powerful creatures of great size. This steer is a quiet, peaceful animal. Except for its large size, it pose no threat to humans. An ox is a large domesticated mammal that looks similar to a bull but is generally used as a draft animal for plowing fields, hauling carts, and to pull heavy loads. They have a broad muscular body covered in short hair that can be brown, black, or gray in color. They have long, pointed horns on their heads and large, strong hooves on their feet. Oxen are typically heavier and slower than bulls and have a calm and docile temperament. The most obvious difference between the buffalo and the ox is easily spotted. When it comes to size, the buffalo is noticeably larger. It has a thicker coat than the ox. Generally, they prefer open grasslands, meadows, and pastures with access to water sources such as rivers, lakes, or ponds. Some oxen may live in forested areas or mountain ranges. In agricultural settings, they may live in pens, barns, or fields with fences or enclosures for protection. While there are wild oxen, the majority of the populace live in human-built habitats. The structures are usually sheds, stables, and open fields where they graze and walk freely.",
    "fox": "Foxs range in size and color but are dog-like in appearance with pointed ears, long snouts, thick fur, and long bushy tails. Fox features typically include a triangular face, pointed ears, an elongated rostrum, and a bushy tail. They are digitigrade (meaning they walk on their toes). Unlike most members of the family Canidae, foxes have partially retractable claws A typical fox has a reddish-brown or grayish-brown fur coat, although there are variations among different fox species. The fox's eyes are usually almond-shaped with a vertical slit pupils, and their pupils can quickly adapt to the light changes. Fox vibrissae, or whiskers, are black. The whiskers on the muzzle, known as mystacial vibrissae, while the whiskers everywhere else on the head average to be shorter in length. Whiskers (carpal vibrissae) are also on the forelimbs. Fox species differ in fur color, length, and density. Coat colors range from pearly white to black-and-white to black flecked with white or grey on the underside. Fennec foxes (and other species of fox adapted to life in the desert, such as kit foxes), for example, have large ears and short fur to aid in keeping the body cool. Arctic foxes, on the other hand, have tiny ears and short limbs as well as thick, insulating fur, which aid in keeping the body warm. Red foxes, by contrast, have a typical auburn pelt, the tail normally ending with a white marking. A fox's coat color and texture may vary due to the change in seasons; fox pelts are richer and denser in the colder months and lighter in the warmer months. Generally, fox habitats can be found in forests, grasslands, deserts, and even urban areas. They typically dig dens or utilize burrows made by other animals for shelter and can be found around rocks, trees, or other structures. The surrounding area may have tall grasses, shrubs, or trees for cover, and foxes may also have access to nearby sources of water.",
    "chimpanzee": "Chimpanzees are large primates that have long yet sparse black hairs covering their bodies except for their face, palms, and the soles of their feet. Their hair not only allows them to remain warm in areas at higher altitudes but also provides their skin with some protection from the sun. The hairless parts of their bodies are light to dark brown depending on the age of the individual (their skin darkens as they mature). They have large ears that give them excellent hearing and a heavy brow ridge over their eyes. They have long fingers and an opposable big toe that helps them to grip things, with their arms also being longer than their legs which enables them to move around on all fours which are known as knuckle-walking. The chimpanzee’s features include long arms, opposable thumbs, a prominent mouth, and a body covered in brown or black hair. The arms of a chimpanzee are longer than its legs and can reach below the knees. The hands have long fingers with short thumbs and flat fingernails. The feet are adapted for grasping, and the big toe is opposable. The pelvis is long with an extended ilium. A chimpanzee's head is rounded with a prominent and prognathous face and a pronounced brow ridge. It has forward-facing eyes, a small nose, rounded non-lobed ears, a long mobile upper lip. Additionally, adult males have sharp canine teeth. Chimpanzees lack the prominent sagittal crest and associated head and neck musculature of gorillas. Chimpanzee bodies are covered by coarse hair, except for the face, fingers, toes, palms of the hands, and soles of the feet. Chimpanzees lose more hair as they age and develop bald spots. The hair of a chimpanzee is typically black but can be brown or ginger. As they get older, white or grey patches may appear, particularly on the chin and lower region. The skin may range from pale to dark, though females develop swelling pink skin when in oestrus. Chimpanzees are adapted for both arboreal and terrestrial locomotion. Chimpanzees are known to inhabit a variety of different regions from the tropical, humid rainforests to the dryer and more arid regions of the savanna and open woodlands. The chimpanzee habitat is typically characterized by lush vegetation, tall trees, and a diverse range of plant and animal species. They live in trees and on the ground, and build nests in the trees for sleeping and resting. The habitat often has streams or rivers nearby, providing a water source for drinking and bathing.",
    "hamster": "Hamsters are small rodents that have stout bodies. Their legs are stubby and stocky legs, and their ears are small. Hamsters have short tails that are even shorter than the length of their bodies. Their ears are furry, and their feet are wide. In general, hamsters have thick and silky fur, and it could be long or short, depending on the hamster. This fur comes in a variety of colors, including black, grey, yellow, red, brown, and white. Some hamsters also have fur that is a blend of several different colors, but the combination will be determined by the breed. One rodent characteristic that can be highly visible in hamsters is their sharp incisors. They have small ears, beady eyes, and sharp teeth. They have furry and soft coats that come in various colors, including brown, gray, white, and golden.  In the wild, hamsters prefer living in warm and dry areas. They like living in steppes, edges of deserts, and sand dunes. Hamster habitat generally includes a cage or enclosure made of plastic or wire materials with various levels or platforms, tunnels, and exercise wheels for the hamster to climb, play, and explore. The habitat also contains bedding materials such as wood shavings or paper-based litter, a food dish, a water bottle, and toys. The cage should be spacious enough to allow the hamster to move around freely and have good ventilation.",
    "squirrel": "These animals are small-sized, nimble rodents. Their bodies are slender, and they have large eyes and bushy tails. Their fur is short and silky and is very soft too. However, the thickness of the fur depends as well as varies from species to species. The fur comes in a variety of colors including grey, brown, yellow, red, black, and white. The color of the squirrels also depends on the type of squirrel. Most species have small yet pointed ears with tiny, sharp claws, giving them the leverage that they need to climb trees quickly and with ease. The Indian giant squirrel features beautiful rust and black fur coat. Interestingly, a solid black coat is considered very rare in squirrels. Squirrels prefer to store nuts in a variety of hiding places and tend to remember where they were hidden. Squirrels typically have slender bodies with very long very bushy tails and large eyes. In general, their fur is soft and silky, though much thicker in some species than others. The coat color of squirrels is highly variable between—and often even within—species. They have pointed ears and large, expressive eyes, and their front teeth continuously grow throughout their lives. Their fur is thick and dense to keep them warm during colder seasons.  Squirrels can be found mostly in mature or nearly mature forests, especially in woodland areas. These animals create their nests themselves with the help of twigs and leaves that they go around collecting. The inside lining of their nests is grass and leaves. Squirrels live in almost every habitat, from tropical rainforest to semiarid desert, avoiding only the high polar regions and the driest of deserts. They are predominantly herbivorous, subsisting on seeds and nuts.",
    "rhinoceros": "Rhinos have a robust, cylindrical body with a large head, relatively short legs, and a short tail. The characteristic feature of these animals is a large horn in the middle of their faces; some species have a second, smaller horn. They are usually grey, black, or brown. Sumatran rhinos, which live in more dense forests and vegetation are diligent about marking trails with feces and urine. A rhinoceros has a large, bulky body with short legs and skin that is thick and gray in color. They have a characteristic horn on their nose which is made of keratin. They also have two smaller horns on their forehead on some species. Their ears are small and they have poor eyesight, but they have a good sense of smell and hearing. They are powerful and impressive animals.  The rhinocero's habitat includes savannas, grasslands, and forests with access to water sources for drinking and wallowing. The terrain could vary from flat plains to hilly areas, and the vegetation might include tall grasses, shrubs, and trees.",
    "rabbit": "The rabbit’s appearance is an animal that sits on its large hind legs and has shorter front legs. The animal also has large ears that vary in size based on the type. The hare looks similar to the rabbit but is not the same. Hares live a relatively solitary life in a simple nest above the ground, while most rabbits live in social groups in burrows or warrens. Hares are generally larger than rabbits, with ears that are more elongated, and with hind legs that are larger and longer. A rabbit typically has a small and compact body, with long ears and a fluffy tail. Their fur can be a variety of colors, including brown, gray, white, and black, and is usually soft to the touch. They have large, expressive eyes and strong hind legs which allow them to hop and run quickly. They typically live in these warrens with a group of other rabbits in meadows, deserts, woods, grasslands, wetlands, or forests. Wild rabbits may live in burrows or dens in fields, forests, or grasslands, while domestic rabbits may live in cages or hutches. In their natural habitats, rabbits may have access to vegetation, hiding spots, and open spaces to run and play. ",
    "wolf": "Wolves are large, four-legged, carnivorous mammals. They have pointed ears, elongated snouts, and bushy tails that curl behind them as a means of expression. Although there are many different subspecies with their own unique coloring, most wolves share the same rough, thick fur with either a gray or beige pattern. In many cases, the animal’s natural coloring will match the landscape that they need to blend in with. The wolf is the largest extant member of the Canidae family, and is further distinguished from coyotes and jackals by a broader snout, shorter ears, a shorter torso and a longer tail. It is slender and powerfully built, with a large, deeply descending rib cage, a sloping back, and a heavily muscled neck. The wolf's legs are moderately longer than those of other canids, which enables the animal to move swiftly, and to overcome the deep snow that covers most of its geographical range in winter. The ears are relatively small and triangular. The wolf's head is large and heavy, with a wide forehead, strong jaws and a long, blunt muzzle. A wolf typically has pointed ears, a long snout, sharp teeth, a thick fur coat that can range from shades of gray, brown, black, or white, and a bushy tail. You’ll see wolves in arctic tundras, mountains, forests, plains, and nearly every other kind of northern environment. A wolf habitat usually includes forested areas, grasslands, remote areas, and mountains. Wolves live in dens, caves, or other hiding places. The habitat can also include water sources such as rivers, streams or wetlands.",
    "chihuahua": "Chihuahuas are the smallest breed recognized by some kennel clubs. Current breed standards defined by registries specify an apple head or apple dome skull conformation. Chihuahuas occur in virtually any color combination, from solid to marked or splashed. Apple dome Chihuahuas have large, round eyes and large, erect ears, set in a high, dramatically rounded skull. Dogs of the older deer type, with a flat-topped head, more widely set eyes, larger ears, and longer, more slender legs, may still be registered. A chihuahua is a small, toy breed dog. They have a rounded head with large, wide-set eyes and erect ears. The body is compact with a short, smooth coat that can be a variety of colors, including fawn, black, white, chocolate, and more. Chihuahuas have short legs and a curled tail that may rest on their back. Chihuahuas are adaptable to various living conditions, including apartments, houses, and small spaces.",
    "weasel": "Weasels are animals with small and narrow heads that are not much thicker than their necks and their short legs and flexible spines mean that they are able to easily maneuver themselves around in small, confined spaces. The Weasel animal has a sharply pointed snout and triangular head, small rounded ears, and black eyes. Their coat is dark or light brown in color on their head, back, legs, and tail and white on their underside and molts twice a year from the darker winter coat to the flatter, lighter one in April, and again from the summer to the winter coat in August or September. This not only ensures that by November the Weasel is as warm as possible but in areas further north, individuals will often change from brown to white in color so that they are camouflaged amongst the snow. The Weasel has evolved to prey on small animals like no other carnivore as their long, slender bodies are perfectly suited for following mice into their burrows. Weasels have a long and slender body covered in brown or tan fur, with a white underbelly. They have short legs and small, rounded ears. Their faces have a pointed snout with sharp teeth, and they have dark, beady eyes. Weasels are animals that are natively found in a variety of habitats such as woodlands, coniferous forests, and on grassy plains.",
    "otter": "Otters are animals that are known for being slim and short. They have muscular necks and short legs. Their long flat tails and four webbed feet help them swim faster. They have short noses and ears and their fur is brown, soft, and thick. Their outer fur varies in its shade of brown, with the fur underneath being lighter. Having two layers of fur keeps them warm and dry. When they are not eating or sleeping they can be seen playing and often choose the bank of a river to turn into their sliding board. Otters have long, slim bodies and relatively short limbs. Their most striking anatomical features are the powerful webbed feet used to swim, and their seal-like abilities for holding breath underwater. Most have sharp claws on their feet and all except the sea otter have long, muscular tails. They have very soft, insulated underfur, which is protected by an outer layer of long guard hairs. Several otter species live in cold waters and have high metabolic rates to help keep them warm. Otters have long, streamlined bodies covered in dense, waterproof fur that ranges from dark brown to reddish-brown. They have short legs with webbed feet and long, powerful tails that are used for swimming. They have small ears and nose and their faces are distinctive with their big, dark eyes and cute nose pads that help them to sniff out their prey. There are many places in the world where otters live. Otters prefer a wet habitat and often make their home on coastlines, lakes, oceans, and freshwater rivers. When it comes to sea otters, water is their preferred habitat to land. The habitat typically includes vegetation for shade and cover, rocks and logs for sunning and resting, and a variety of prey for feeding.",
    "buffalo": "All African buffalo are large and cattle-like animals, though they don’t share a close genetic link to cattle. African buffaloes come in four varieties. These include the cape, West Africa savanna, Central Africa savanna and forest buffalo, and are mostly distinguished by their horn shape and relative size. The most common are the Cape buffalos, with a dark-brown coating of short, coarse fur and large, distinctive horns that curl downward and back up, similar to a ram. Savanna buffalo are similar to Cape buffalo, but with slightly shorter horns and a wide range of fur styles ranging from light brown to virtual black. Forest buffalo are generally smaller than the others, with lighter brown (or even reddish) fur and shorter horns. Younger savanna buffalo sometimes have light brown fur as well, but most forest buffalo keep theirs into adulthood. A buffalo is a large and heavy animal with a broad body and a massive head. It has two curved horns extending from the top of its head, shaggy brown or black fur, and a short, stocky tail. Buffaloes also have a thick mane of hair on their neck and shoulders.  Buffalo habitat can be described as open grasslands or prairies with access to fresh water sources such as lakes, rivers, or streams. These areas are typically characterized by tall grasses, shrubs, and scattered trees that provide the necessary shelter and food for the buffalo to thrive. The landscapes are often flat and vast, with little variation in the topography, and may include rocky outcroppings or hills in certain regions.",
    "zebra": "Zebras are heavy-bodied animals that are perfectly designed for speed with their long and slender legs and narrow hooves helping them. In the same way as horses, they only have a single toe on each foot which they walk on the tip of and is protected by their tough hooves. Their black and white stripes are unique to each individual and help them to identify each other when in the herd. Zebras have long necks and heads that mean they can easily reach the grass on the ground and a mane that extends from their forehead and along their back to the tail. The pattern of their stripes varies between the species with Grevy’s and Mountain Zebras having narrower stripes and white undersides, while the Common Zebra has broad stripes that cover its entire body. The Grevy’s Zebra is not only the largest of the Zebra species but is also easily identifiable by its large, rounded ears. A zebra has black and white stripes all over its body, with the stripes varying in thickness and pattern depending on the species. They have a long, slender head with erect ears and a mane that stands up along their neck. Their body is muscular and relatively short, with four hooves that are adapted for running on grassy terrain. Some species of zebra also have a brown or tan underbelly, and their tails contain long, flowing black hair.  Zebras are animals that are found inhabiting the open grasslands and plains where they spend most of their time grazing on the grasses. Zebras inhabit grasslands, savannas, and even mountainous regions in Africa. The habitat generally consists of vast plains with tall grass and scattered trees, where zebras graze and roam in herds. The landscapes may include rocky outcrops and hilly areas, and water sources are crucial for their survival.",
    "giant panda": "The giant panda is a medium to large-sized bear that like other species has a large head, short tail, and a long muzzle with a large nose, which gives them an excellent sense of smell. The thick fur of the giant panda is creamy-white in color with large patches of black on the limbs, shoulders, ears, and nose, and distinctive black patches around their small eyes. The giant panda eats almost only bamboo and so has a number of physical adaptations to help with its consumption including an extension of their wrist bone which acts a bit like a thumb, allowing the giant panda to grip onto bamboo stems. They also have large jaws with strong jaw muscles that along with their flat molars, allow the giant panda to crush bamboo stems and leaves in order to extract nutrients. The giant panda has a body shape typical of bears. It has black fur on its ears, eye patches, limbs and shoulders. The rest of the animal's coat is white. The bear's distinctive coat appears to serve as camouflage in both winter and summer environments. The white areas may serve as camouflage in snow, while the black shoulders and legs provide crypsis in shade. The black ears may signal aggressive intent, while the eye patches might facilitate them identifying one another. The giant panda's thick, woolly coat keeps it warm in the cool forests of its habitat. A giant panda has a distinctive black and white coat. Its eyes are black, and its ears are rounded and black on the outside with white on the inside. Its arms and legs are black, and it has black patches around its eyes and on its ears, legs, and shoulders. The rest of its body is white. Its body has a stocky and muscular build with a round head and a short tail. The giant panda habitat is usually described as dense bamboo forests with occasional clearings or meadows. The forests often have steep slopes and valleys, and are characterized by a moist climate. Typically, the giant panda habitat has a green and lush appearance due to the abundance of bamboo and other vegetation. These high-altitude forests are cool, cloudy, and moist and are generally subjected to a high level of rainfall.",
    "deer": "Most deer species share in common a basic set of characteristics: two hooves on each foot, a four-chambered stomach, long and spindly legs, short tails, and a coat color that usually varies between brown, red, or gray. But the most prominent and conspicuous characteristic is the set of antlers on the head. All males possess antlers, while females lack them. Only in caribou (or reindeer) do the females grow antlers as well. The size, curvature, and structure of the antlers are a source of immense variation between species. Some of them have a large central palmate (like moose antlers), while others have long single beams with varying numbers of branches. Some deer have nothing more than simple spikes for antlers. The reindeer have the largest antlers in relation to body size, but the moose can rival them in absolute terms. Characteristics typical of deer include long, powerful legs, a diminutive tail and long ears. Deer exhibit a broad variation in physical proportions. Coat color generally varies between red and brown, though it can be as dark as chocolate brown in the tufted deer or have a grayish tinge as in elk. Different species of brocket deer vary from gray to reddish brown in coat color. Deer typically have four long, slender legs with hooves, a short tail, and a narrow body. They can range in color from reddish-brown to gray-brown, with white spots on their coat. They have large ears that can move independently to detect sound, and their eyes are located on the sides of their head, giving them a wide field of vision.  Deers thrive in deciduous forests, tropical rainforests, wetlands, and grasslands. A few species inhabit the cold tundra of the north, feeding on the sparse vegetation. They are most frequently found in the areas between forests and open plains. They are also capable of adapting to urban and suburban settings.",
    "pig": "In general, however, pigs are known for their stout bodies, short legs, and prominent snouts. Most of them have sparse patches of bristles covering their skin. Some have patterns of spots, while others are more uniform in color. They have four hoofed toes on each foot, and their large heads contain a total of 44 teeth. These animals have scent glands covering their faces, and they rub their faces against objects to spread their scent and claim their territory. Their snouts are highly sensitive, and they dig into the soil to root around for food. They might raise the crest of hair on their backs, grind their teeth, jerk their head, or cock their ears. The pig typically has a large head, with a long snout which is strengthened by a special prenasal bone and a disk of cartilage at the tip. Four hoofed toes are on each foot, with the two larger central toes bearing most of the weight, but the outer two also being used in soft ground. Most pigs have rather a bristled sparse hair covering on their skin, although woolly-coated breeds such as the Mangalitsa exist. A pig has a plump, round body covered in coarse bristly hair, usually pink or black in color. They have a snout with two small holes for nostrils, small eyes, and flat floppy ears. Pigs have short, stubby legs with cloven hooves and a curly tail.  They are found in grasslands, rainforests, wetlands, scrublands, temperate forests, and savannas everywhere in the world. The pig habitat generally includes an outdoor space that is large enough for the pigs to roam and root around. The outside space often includes a fenced in area or pasture with dirt, mud or straw for the pigs. ",
    "lion": "Lions have a short coat of tawny or golden fur with a long tail that has a tuft of longer fur at the end. The markings on their coats are much fainter than the bold stripes and spots displayed on other felines which helps these large carnivores in going unseen when stalking prey in the long grasses. The lion animal is one of the largest cats in the world with males being taller and heavier than females and displaying a mane of long hair around their faces. The mane of the male lion ranges from blonde to red, brown, and black in color and covers the head, neck, and chest. Likewise, there is an uncommon color mutation in lions that leaves their coat extremely pale. The lion is a muscular, broad-chested cat with a short, rounded head, a reduced neck and round ears. Its fur varies in color from light buff to silvery grey, yellowish red and dark brown. The colors of the underparts are generally lighter. A newborn lion has dark spots, which fade as the cub reaches adulthood, although faint spots often may still be seen on the legs and underparts. Males have broader heads and a prominent mane that grows downwards and backwards covering most of the head, neck, shoulders, and chest. The mane is typically brownish and tinged with yellow, rust and black hairs. The tail of all lions ends in a dark, hairy tuft. Its skull is very similar to that of the tiger, although the frontal region is usually more depressed and flattened, and has a slightly shorter postorbital region and broader nasal openings than those of the tiger.  Lions prefer areas of open woodland, scrub, and long grasslands. The lion's natural habitat is typically located in savannah grasslands or dense forests. The grasslands offer a mix of open areas for hunting and dense vegetation for cover, while the forests have an abundance of prey and adequate hiding spots. The habitat includes rocks, trees, water sources, and tall grasses.",
    "mouse": "Any rodent called a mouse has a small body, rounded ears, a pointed snout, a long tail, a uniform color for the coat with the tail and ears, and a high breeding rate. Pet mice can come in several different possible coat colors and coat types: Agouti, self, tan, pointed, patchwork, and marked are general coat colors divided into specific tickings, while hairless, rex/frizzy, satin, longhair, and shorthair are possible coat types. The common standard for the fancy mouse is a white color with a shorthair coat. A mouse is a small rodent. Characteristically, mice are known to have a pointed snout, small rounded ears, a body-length scaly tail, and a high breeding rate. Mice are also popular as pets. In some places, certain kinds of field mice are locally common. They are known to invade homes for food and shelter. A mouse is a small mammal with a pointed snout, long tail, and rounded ears. It has small eyes and sharp teeth. It typically has a gray-brown or tan fur with a lighter colored belly. A mouse typically has four legs and five digits on each foot, including a thumb-like digit used for grasping.  The most common species around are the house and the field mouse, both named by their primary habitat, although both can live in and around houses and fields. Typically a mouse habitat can be a cage or a box with bedding material such as sawdust or shredded paper, food and water containers, toys, and hiding places. The cage or box can be made of different materials such as plastic or wire mesh.",
    "polar bear": "Polar bears are one of the few large mammals found in such hostile conditions and have adapted well to their life on the ice. Their fur is thick and dense and is made up of a warm undercoat with longer guard hairs on top that are clear, hollow tubes that trap warmth from the sun and transmit it directly down to their black skin, which then absorbs the welcome heat. The polar bear is an animal with a strong and muscular body, broad front paws that help when paddling in the water, and fur on the bottom of its feet that not only helps to keep them warm but also gives the polar bear extra grip when moving about on the ice. They have very long necks in comparison to other bear species, which enables their head to remain above the water when swimming. They also have more elongated muzzles and smaller ears than their relatives. Compared with its closest relative, the brown bear, the polar bear has a more elongated body build and a longer skull and nose.The legs are stocky and the ears and tail are small. However, the feet are very large to distribute load when walking on snow or thin ice and to provide propulsion when swimming. The pads of the paws are covered with small, soft papillae (dermal bumps), which provide traction on the ice. The polar bear's claws are short and stocky compared to those of the brown bear, perhaps to serve the former's need to grip heavy prey and ice. The claws are deeply scooped on the underside which assists in digging in the ice of the natural habitat. The white coat usually yellows with age. A polar bear is a large white bear with a thick layer of fat beneath its skin to insulate it from the frigid temperatures of the Arctic. It has a rounded head, small ears, and a long neck. Its front paws are large and powerful with five toes each, each equipped with sharp claws that are ideal for digging in ice or snow. The polar bear's fur is thick and dense, which helps it trap warmth and stay dry. Its nose is black and the overall facial expression is serious and determined. Polar bears are animals that are found on the icy coasts. The polar bear habitat is characterized as a cold, icy and harsh environment, with icebergs, glaciers, and ice sheets that stretch for miles covering vast expanses of the Arctic region surrounding the North Pole. The landscape is barren, desolate, and white, with no trees or vegetation due to the cold, windy, and dry climatic conditions.",
    "collie": "Collies are medium to large-sized dogs with a long, lean body and a graceful, elegant gait. They have a long, wedge-shaped head with a smooth forehead, a pointed snout, and a black nose. Their eyes are large, almond-shaped, and typically brown. Their ears are also large and stand erect or fold forward, giving them an alert and attentive expression.Collies have a thick, double coat that is usually long and silky, with feathering on the legs, chest, and tail. They come in a variety of colors, including sable, white, and tri-color (black, white and tan). Collies have a white ruff around their neck, which is more prominent in the rough-coated variety. The fur may be short, or long, and the tail may be smooth, feathered, or bushy. The occasional naturally bob-tailed dog would occur. The tail can be carried low with an upward swirl, or may be carried higher but never over the back. Each breed can vary in coloration, with the usual base colors being black, black-and-tan, red, red-and-tan, white with a colored head with it without other body coloration of sable, black and tan, blue merle, sable merle sable. They often have white along with the main color, usually under the belly and chest, over the shoulders, and on parts of the face and legs, but sometimes leaving only the head colored – or white may be absent (unusual) or limited to the chest and toes.  Collies are known to thrive in natural habitats with open fields, hills, and meadows. Overall, the collie habitat is characterized by vast outdoors with natural landscapes. ",
    "raccoon": "It has a pointed snout, a wide skull, rounded ears, sharp teeth, a big hunched back (as a result of the hind legs being bigger than the front legs), and a bushy tail with four to 10 black rings. The most distinctive characteristics are the black markings around the eyes that resemble a mask (though not every raccoon has this). Much of the animal’s coat consists of dense gray underfur to insulate it from the cold. Almost all raccoons have the same general color, but an all or mostly white albino variant does exist in nature. The most characteristic physical feature of the raccoon is the area of black fur around the eyes, which contrasts sharply with the surrounding white face coloring. The slightly rounded ears are also bordered by white fur. Raccoons are assumed to recognize the facial expression and posture of other members of their species more quickly because of the conspicuous facial coloration and the alternating light and dark rings on the tail. The dark mask may also reduce glare and thus enhance night vision. On other parts of the body, the long and stiff guard hairs, which shed moisture, are usually colored in shades of gray and, to a lesser extent, brown. The dense underfur, which accounts for almost 90% of the coat, insulates against cold weather. Raccoon skulls have a short and wide facial region and a voluminous braincase. A typical raccoon has a black mask-like pattern around its eyes, a bushy and striped tail, and dark fur. Its body is round and compact with short legs. Its paws are nimble with sharp claws for climbing trees and scavenging food.  Raccoons are extremely adaptable creatures that can thrive in woodlands, grasslands, suburban, and even urban areas; almost anywhere with enough water and some trees or other large structures for protection. They often make their homes in trees, hollow logs, and dens in the ground. They are also frequently found near bodies of water, as they are excellent swimmers and enjoy fishing for prey.",
    "cow": "Cows are animals that come in a wide array of breeds, colors, sizes, and even shapes. Standing on four legs with hooved feet. Most cows have a thin layer of bristly hair, but certain breeds have longer hair. These skin and hair combinations come with a number of distinct patterns. The holstein is the most well-known style, with irregular black and white shapes, with a strip of white between the eyes. A “red” holstein has brown or reddish brown patches in place of the black. Angus cows are black from head to tail. The Highland cow features long, shaggy, brownish-red hair. Though there are hundreds, if not thousands, of breeds with different markings, most feature variations on gray, brown, black, and white hides. Indicus cows of any breed have another feature: a “hump.” This protrusion on the back of these cows’ necks is the easiest way to tell them from taurus cows. Almost all cows have horns. These range in length and shape across breeds. Sticking almost straight out to the sides from its head and reaching roughly three feet long each, the horns on a Texas Longhorn cow are easy to spot. Meanwhile, a Brahman cow has roughly six-inch-long horns that point up and back from its head. The English longhorn can have horns that point mostly downward, curving similarly to a sheep’s horns. Cattle are large quadrupedal ungulate mammals with cloven hooves. Most breeds have horns, which can be as large as the Texas Longhorn or small like a scur.  A cow typically has a large body with four legs and a round, elongated head with two ears on top. They have large, kind eyes and a moist nose. They also have a long tail that can be used to swat flies. Cows are often of various shades of brown, black or white and have white spots or patches on their skin. Cows are animals that can survive in many climates and places. In general, cows need access to a wide range of space, so they can graze on grasses. Whether in the mountains, jungle, or wide open plains, cows can adapt to many different environments. This may include open fields or pastures, barns or sheds for shelter, and watering holes or troughs.",
    "horse": "All horses have long necks that hold up their large, long heads. They have big eyes and ears, which are well-adapted for many environments. A mane of long hair grows down along their necks and their short tails are covered in coarse hairs, too. They come in a variety of colors because they have been bred so long for different traits. These animals are famously a hoofed mammal with one large ‘toe’ at the end of each leg. Their hooves consist of horn material which comes in different colors. Black is the most common hoof color, but horses with white feet often have white hoofs. White hooves are actually more brittle than pigmented ones. Appaloosa horses have a beautiful mixture of multiple colors. These types of painted horses often have striped hoofs that include both pigmented and white hoof material. These animals are well-suited to all kinds of environments and climates. Domestic horses can live almost anywhere as long as they have shelter, food, and space to run. horses are generally known for their distinct physical characteristics such as a long face, large nostrils, muscular build, four legs, hooves, a mane and tail of hair, and varying coat colors and patterns. They also have big, expressive eyes, long necks, and pointed ears. horses are generally found in open fields, meadows, pastures, and sometimes in stables or barns if they are domesticated. Their natural habitat includes grassy plains, hills, and forests with access to water sources. Their surroundings are usually green and have varying degrees of vegetation cover. ",
    "blue whale": "This great mammoth has an extremely long, narrow body which means that allows them to swim more easily. Without a doubt, this species of whale is the biggest whale living today. Their skin is smooth and greyish-blue in color with a lighter underside. They have a series of pleats on their throats which allows them to expand to more than four times their normal size feeding. The tail of the blue whale splits into rubbery flukes which help to improve swim speed and efficiency. These are hard and bristly to function as filters for blue whales to feed by taking in great amounts of water. Blue whales have two blowholes that expel water from their lungs. They do this from the top of their heads when they come to the surface every so often to breathe. The Blue Whale has an enormously long body that is slim and narrow, which means that they are able to cut through the water with ease. They have a sleek, streamlined body that is blue-gray in color with mottled patterns on their skin. Their head is large and flat with a small dorsal fin located toward the rear of the body. Blue whales also have a long, narrow, and V-shaped tail fin called fluke that propels them through the water.  Found in oceans mostly worldwide, blue whales migrate at different times of the year. In the summer months, Blue Whales are found in the cold waters where they feed on plentiful food, before moving towards warmer waters to breed. The migratory patterns of blue whales are generally less well understood and seem more unpredictable than other baleen whales, even skipping migration some years. Blue Whales are found in both polar and tropical waters worldwide, migrating between the two at different times of the year.",
    "sheep": "Sheep are stocky-hooved mammals with four legs, thick torsos, and short tails. These animals are stocky-hooved mammals with four legs, thick torsos, and short tails. Sheep are even-toed ungulates, which means that their hooves split neatly down the middle. All of these animals are covered in thick hairs that are supported by a soft wooly undercoat. Both wild and domestic sheep can have horns, but wild species tend to have far more impressive spirals. As with most species, the rams will almost always have larger horns than the ewes. These animals are shorter than other ungulates. The fluffy wool that they are known for tends to make them look bigger than they actually are, and the impressive.  A sheep is a mammal that has a woolly coat of fur that can range from white to black or brown. They have a round body shape with four legs that end in cloven hooves. They also have a long snout, two ears, and a pair of eyes that can appear wide and alert. Their woolly coat often covers their face, legs, and feet, giving them a fluffy and cuddly appearance. Because of their thick wool coats, they are capable of living in almost any climate. Fluffy wool covering their body, usually white or light brown in color. Curled horns or small rounded ears on top of their head. A rounded body shape with four sturdy legs, often standing in a grazing position. A distinctive face with a soft, rounded nose and wide-set eyes. Wool: Sheep are known for their woolly coats, which can be thick and fluffy, or short and tight depending on the breed. Ears: Sheep have long, floppy ears that can sometimes droop down over their eyes. Face: Sheep have a distinctively rounded face with a pointy snout and wide-set eyes. Horns: Some breeds of sheep have horns, which can range from small and curved to large and spiral-shaped.",
    "seal": "While they do share several features in common, including long, flexible bodies, flipper-shaped limbs, short snouts, and round heads, it is also easy to spot the many differences between them. The location of the ears and the presence of thicker coats of fur are the two major characteristics that distinguish the eared seals from true seals. One glance at these animals’ anatomy will tell you that seals are extraordinarily well-adapted to water. Their dense layers of blubber keep them insulated from the frigid cold. They also have the remarkable ability to detect vibrations in the water with their whiskers. It allows them to glide gracefully through the water to catch prey and avoid predators. Although Pinnipeds cannot match the top speed of some aquatic animals, their greatest advantage in the water is their flexibility. Despite their size, their smooth, streamlined bodies can execute sharp turns on a dime. Thanks to their whiskers, these marine mammals are able to detect vibrations in the water. Pinnipeds inhabit saltwater regions almost exclusively, but they do swim up rivers and estuaries to hunt for food. When they reach land, they inhabit beaches, caves, tide pools, shoals, and even man-made structures such as piers and oil platforms. Pinnipeds strongly prefer cold water filled with nourishing fare.",
    "bat": "A bat has a thin layer of brown, black, or gray fur. They have small or large ears and small black eyes. The wings of a bat are its most memorable feature. A bat’s wing has four bones that you can think of as its fingers, as well as a bone serving as a thumb. A thin layer of skin called a membrane connects these bones creating a bat’s flexible wing. If you’ve ever watched a bat fly, you know it can change direction in an instant. It’s these flexible finger bones in their wings that give them that skill. A bat’s wings also give it speed. The fastest bat can travel 99 mph. Bats wrap their flexible wings around them when they sleep. a bat generally has a dark colored fur or skin, a wingspan ranging from around 6-40 inches, large ears for echolocation, and sharp teeth. Their wings are made of thin membrane-like skin that stretches over elongated fingers. They also have a unique head shape with a pointed muzzle and large eyes. Bat habitats can vary greatly depending on the species and location, but they often include dark, damp, and enclosed spaces such as caves, mines, trees with crevices, and buildings. Overall, bat habitats are characterized by their darkness, humidity, and sheltered conditions. Wings: Bats have wings that are typically longer and more narrow than those of birds. They are also made of a thin membrane of skin that extends between the elongated fingers of the bat's forelimbs. Ears: Bats have large, pointed ears. These ears are used to detect high-frequency sounds that they use for echolocation. Face: Many bat species have distinctive facial features, such as a flattened nose or a protruding snout. They have a streamlined body with elongated limbs and digits, which allow them to efficiently fly and maneuver in the air. Their wings are made up of a thin, flexible membrane of skin called the patagium that extends from the bat's elongated fingers to its sides and sometimes its legs.",
    "giraffe": "The Giraffe is an animal with an enormously long neck which allows it to exploit the leaves and vegetation that are too high up for other animals to find. Despite their length, the neck of the Giraffe actually contains the same number of bones as numerous other hoofed mammals but they are simply longer in shape. The giraffe’s elongated neck leads into a short body, with long and thin, straight legs and a long tail that is tipped with a black tuft that helps to keep flies away. The Giraffe tends to be white in color with brown or reddish markings that cover its body (with the exception of its white lower legs). The markings of each Giraffe are not only unique to that individual but they also vary greatly between the different Giraffe species in size, color, and the amount of white that surrounds them. All giraffes though have large eyes that along with their height give them excellent vision, and small horn-like ossicones on the top of their heads. Giraffes are animals that inhabit open woodlands and savannah where using their height they are able to see for great distances around them to watch out for approaching danger. A giraffe is a tall and slender mammal with a long neck and legs. Their coat is pale yellow with dark brown spots or irregular patches covering their whole body except for their underbelly. Their spots are unique to each individual and help them to blend into their habitat, making them difficult to spot by predators. Giraffes have small horn-like ossicones on top of their head, and their ears are small and tufted with hair. Their eyes are large, dark, and have long eyelashes. Long neck: Giraffes are well-known for their long necks, which are an adaptation for reaching high branches and leaves in trees. Spots: Giraffes have a distinctive spotted coat pattern, with irregular-shaped patches of various shades of brown separated by white spaces. Horns: Giraffes have a pair of ossicones (horns) on the top of their heads, which are covered in fur and are used in fighting. Legs: Giraffes have long, slender legs that are about six feet tall, making them the tallest mammals on earth. Tail: Giraffes have long tails that end in a tuft of black hair.",
    "rat": "These animals can have black, brown, gray, or white fur. They have two big ears, dark eyes, and long whiskers. They have a mouthful of sharp teeth including 4 incisors. Their teeth continue to grow throughout its life. One of their most notable features is a long, hairless tail. Generally, the animal’s tail is as long or longer than its body. The animal uses its tail for more than one purpose. For one, it helps it to regulate its temperature. Its tail is hairless so it’s able to release heat to keep a rat’s body cool. Alternatively, when the animal is cold, it can curl its tail around itself to stay warm. Secondly, a rat’s tail helps it to maintain its balance. They climb up walls and trees and walk along narrow ledges. Their tail helps them to keep their weight balanced so they don’t fall. In addition, their black, brown, or gray fur helps them to blend in with the dark underground environment. Rats are adaptable to a variety of habitats. Rats have small, pointy heads and long tails that are hairless and scaly. They have fur that can be gray, brown, black, or white, and their bodies are covered in small, fine hairs. Rats have sharp teeth and long, thin whiskers that are positioned around their snouts. They have large ears that are often erect, and their eyes are small and dark. Size and body shape: Rats are typically smaller than many other rodents, with a distinctive long and slender body shape. Fur texture and color: Rats have short, smooth fur that can be various colors, including white, black, gray, or brown. Tail: Rats have long, thin tails that are typically hairless and scaly. Facial features: Rats have pointed snouts, sharp teeth, and whiskers.",
    "bobcat": "Due to the fact that the Bobcat belongs to the same family as the Lynx, these animals are similar in appearance but not at all the same. The Bobcat is smaller in size and has smaller feet and ear tufts than the Canadian Lynx, and often tends to be darker in color. Bobcats have beige to brown or reddish fur that is mottled or spotted with the intensity of these markings depending on the individual and where it lives (those found in more open, arid areas tend to have fewer markings than those found amongst dense cover). Like the larger Lynx, the Bobcat has ear tufts that are thought to heighten its hearing along with also having a ruff of longer fur around its face. The exact appearance of the Bobcat depends on what kind of habitat it is found in as the differing coat colors allow the individual to remain as camouflaged as possible in its surroundings. A bobcat is a medium-sized wild cat with a distinctive appearance. They have short, stubby tails, tufted ears, and muscular bodies covered in thick fur. Their fur is light brown or reddish-brown with black spots or stripes. They have a ruff of fur around their face and a white underbelly. Short tail with black tip. Tufted ears with distinctive black tufts. Spots on the fur coat, usually brown or reddish-brown with black spots. White underbelly and inner legs. Muscular build with relatively short legs compared to the body size. Facial features such as the distinctive cheek ruffs and black streaks extending from the corners of the eyes.",
    "walrus": "Walruses are animals with large and elongated bodies that are wider at the head and neck and taper towards their tail which is embedded in a web of skin. Their tough and wrinkled skin is covered by a layer of sparse, coarse hairs and is generally grey or brown. However, whilst sunbathing out of the water, the skin of the Walrus (which can be up to 4cm thick) develops a pink-red coloration. Walruses have two pairs of flippers that are used to help to propel these large animals with great agility through the water, with their bodies powered by their back flippers while the front flippers are used to steer them in the right direction. On land, they move about awkwardly on all fours, curling their back flippers underneath them at right angles to give them more support. The skin on the bottom of their flippers is rough and knobbly which helps to prevent these enormous animals from slipping on the ice. Walruses have long tusks (extra-long upper canine teeth) that are used for both fighting and digging into the ice when they are pulling their heavy bodies out of the water. When sunbathing out of the water, the skin of the Walrus develops a pink-red coloration. Walruses are animals that are found throughout the northern Atlantic and Pacific Oceans where they inhabit ice floes and rocky coastlines, along with spending a great deal of time in the freezing cold water. A walrus has a large, bulky body with a thick layer of blubber to keep it warm in cold water. It has two long tusks, which are actually elongated canine teeth that can grow up to 3 feet long in males. Its whiskers (vibrissae) are also very long and help it locate food in the ocean. Walruses have small eyes, small ears, and a broad snout with two nostrils. Their bodies are covered in a layer of short, coarse hair that is often gray or brown in color.",
    "dolphin": "Most people visualize dolphins as grey in color, but many have blocks of black, white, or even yellow. Some are speckled. One species of river dolphin is even pale pink. Dolphins have torpedo-shaped bodies with generally non-flexible necks, limbs modified into flippers, a tail fin, and bulbous heads. Dolphin skulls have small eye orbits, long snouts, and eyes placed on the sides of its head; they lack external ear flaps. Dolphins have conical teeth, as opposed to porpoises' spade-shaped teeth. Dolphins are marine mammals that have a streamlined body with a long snout, called a rostrum, that contains many teeth. They have a dorsal fin on their back and pectoral fins on either side of their body that are used for balance and steering. Dolphins have a sleek and smooth skin that is typically gray in color, but can also be black, white, or various shades of gray and brown. They have a blowhole on their head that allows them to breathe air when they surface, and two small eyes on either side of their head. These animals can be found in all of the world’s oceans, and they are especially prominent in coastal areas. These are communicative social animals that live in groups called pods. Dolphins are marine mammals that have a streamlined body with a long snout, called a rostrum, that contains many teeth. They have a dorsal fin on their back and pectoral fins on either side of their body that are used for balance and steering. Dolphins have a sleek and smooth skin that is typically gray in color, but can also be black, white, or various shades of gray and brown. They have a blowhole on their head that allows them to breathe air when they surface, and two small eyes on either side of their head. "
}